import random

Question = ["문자나 소리, 동영상 등을 0과 1로 변환하는 과정을 일컫는 말로, 정보의 형태나 형식을 변환하는 것을 무엇이라고 하는가??",
            "정보가 가진 확률적 특성을 무엇이라고 하는가?",
            "인간이 생각을 전개하는 형식과 규칙을 과학적으로 기술하고 처리할 수 있는 방식을 제시함으로써 컴퓨터 탄생의 기초가 된 것은 무엇인가요? (2가지)",
            "웹의 구성요소 4가지를 적으시오",
            "커뮤니티 구성원들이 지도를 만들기 위해 정보를 수집하고 그 정보를 공유하는 일련의 과정을 무엇이라고 하는가?",
            "다수의 사람들이 서로 협업하거나 경쟁하는 과정을 통하여 얻게 되는 집단의 지적 능력을 무엇이라고 하는가?",
            "핀테크는 금융과 IT가 결합된 서비스를 의미한다. 다음 중 성격이 다른 하나는? (카카오페이, 네이버페이, 토스, 카카오뱅크 중 1택)",
            "대규모 데이터로부터 의미있는 가치를 추출하고, 초고속 수집-발굴-분석을 지원하도록 고안된 차세대 기술을 무엇이라고 하는가",
            "소셜미디어란 무엇인가?",
            "디지털기술을 이용한 정보 시스템을 [  ] 이라고 한다. [ ] 안에 들어갈 말은?",
            "휴대전화를 하는 인간으로 스마트폰을 생활화한 인류를 [     ] 라고 칭한다. [ ] 안에 들어갈 말은?",
            "세상과 늘 연결되어 있는 인류를 [    ]라고 칭한다. [ ]안에 들어갈 말은?",
            "사람 - 사람, 사람 - 기계, 기계-기계 간의 정보를 전달하는 체계를 무엇이라 하는가?",
            "통신 상에서 컴퓨터 간에 정보를 교환하기 위한 약속된 체계나 공동의 규약을 무엇이라 하는가?",
            "영문자를 표현하는 국제 표준 코드를 [       ] 라고 한다 [ ] 안에 들어갈 말은?",
            "세계의 언어를 통일된 방법으로 표현하는 국제 코드 규약을 [     ] 라고 한다. [ ] 안에 들어갈 말은??",
            "정보를 효율적이고 정확하게 전달하는 방법을 제시한 학자는 누구인가?",
            "서로 자원이나 정보들을 공유하는 서비스를 [    ] 서비스라고한다 [ ] 안에 들어갈 말은?",
            "통신장치를 통해 연결된 컴퓨터 및 장치들의 집합체를 [      ] 라고 한다. [ ] 안에 들어갈 말은?",
            "군대와 대학-연구기관-정부를 연결한 최초의 인터넷을 무엇이라고 하는가?",
            "Tim Berners-Lee는 1990년에 최초로 [    ] 을 가동하였고 1993년에 [     ] 을 개발하였다. [ ] 안에 들어갈 말을 각각 쓰시오",
            "Tim Berners-Lee는 웹에 대한 모든 특허를 누구나 무료로 사용할 수 있도록 공개하였는데 이를 [     ] 라이선스라고 한다. [] 안에 들어갈 말을 쓰시오",
            "사람과 컴퓨터프로그램을 판별해주는 보안기술을 [   ] 라고 한다. [ ] 안에 들어갈 말을 쓰시오",
            "인터넷 상에서 자신의 생각을 일기처럼 차곡차곡 기록할 수 있는 서비스를 [   ] 라고 힌다. [] 안에 들어갈 말을 쓰시오",
            "인터넷 이용자들이 직접 만들거나 가공한 콘텐츠이며 텍스트, 이미지, 오디오, 동영상 모두 해당한다. 이는 무엇인가?",
            "불특정 다수가 협업을 통해 내용과 구조를 수정할 수 있는 웹사이트를 무엇이라 하는가?",
            "ICT기술을 활용하여 상품과 서비스를 교환하는 거래를 무엇이라하는가?",
            "대중의 주목을 받는 것이 경제적 성패의 주요 변수가 되는 경제활동을 무엇이라 하는가?",
            "물품을 소유의 개념이 아닌 서로 대여해 주고 차용해 쓰는 개념으로 인식하는 경제활동(ex: Socar, 카카오택시, Uber)을 무엇이라하는가? ",
            "금융과 IT가 결합한 서비스를 무엇이라하는가?",
            "공인인증서나 OTP없이 비밀번호 입력이나 지문인식 등의 간단한 인증을 통해 구매 절차를 간소화한 전자결제 서비스(ex: 카카오페이, 네이버페이, 삼성페이)를 무엇이라 하는가?",
            "인터넷을 기반으로 다양한 기기에서 TV, 영화, 오디오 등 다양한 미디어 콘텐츠를 스트리밍으로 제공하는 서비스를 무엇이라 하는가?",
            "초연결, 빅데이터, 인공지능 등 디지털롸 촉발되는 지능화 혁명을 무엇이라 하는가?",
            "각종 사물에 센서와 통신 기능을 내장하여 인터넷에 연결하는 기술을 무엇이라하는가?",
            "빅데이터의 특징 3가지 (3V)를 각각 쓰시오",
            "기계가 자동으로 대규모 데이터에서 중요한 패턴과 규칙을 학습하고 의사결정, 예측 등을 수행하는 기술을 무엇이라 하는가? (ex; 음성인식, 사진 태그 생성, 얼굴기반 감정인식)",
            "인공신경망에 기반을 둔 머신러닝의 한 종류로써 사진 속 물체 인식/판별, 음성 인식, 자연언어 처리, 자동번역등을 수행하는 기술을 무엇이라 하는가?",
            "소프트웨어를 통한 인간의 한계 확장의 3형태를 쓰시오",
            "기계적인 방식으로는 수학의 모든 사실들을 만들어 낼 수 없다는 정리를 무엇이라 하는가?",
            "현재 컴퓨터의 원형으로 계산이 가능한 모든 문제를 풀 수 있는 튜링기계를 무엇이라 하는가?",
            "논리적 사고를 수학적으로 표현한 학자는 누구인가?",
            "부울의 논리연산 체계를 전기로 구현한 학자는 누구이며 이 학자가 만든 대표적인 것은 무엇인가?",
            "개인이 다양한 콘텐츠를 직접 생산하고 공유할 수 있는 커뮤니케이션 플랫폼을 무엇이라하는가?",
            "인간이 지닌 지적 능력의 일부 또는 전체를 인공적으로 구현한 것을 무엇이라하는가?"
            ]

Question_solve = {Question[0]: "부호화", Question[1]: "엔트로피", Question[2]: "튜링 기계, 논리게이트", Question[3]: "웹 브라우저, 웹 서버, HTML, HTTP",
                  Question[4]: "커뮤니티 매핑", Question[5]: "집단 지성", Question[6]: "카카오뱅크", Question[7]: "빅데이터기술", Question[8]: "관계를 총칭하는 서비스",
                  Question[9]: "인터넷", Question[10]: "호모 모빌리쿠스", Question[11]: "호모 스마트쿠스", Question[12]: "코드(부호)", Question[13]: "프로토콜",
                  Question[14]: "아스키코드", Question[15]: "유니코드", Question[16]: "섀넌", Question[17]: "P2P", Question[18]: "네트워크", Question[19]: "ARPANET",
                  Question[20]: "웹 서버, 웹 브라우저", Question[21]: "Public Domain", Question[22]: "캡챠(CAPTHCA)", Question[23]: "블로그(Blog)", Question[24]: "UCC",
                  Question[25]: "위키(Wiki)", Question[26]: "전자 상거래(E-Commence)", Question[27]: "주목경제(Attention Economy)", Question[28]: "공유경제(Sharing Economy)",
                  Question[29]: "핀테크(FinTech)", Question[30]: "간편결제 서비스", Question[31]: "OTT 서비스 : Over The Top)", Question[32]: "4차 산업혁명",
                  Question[33]: "사물인터넷 (IoT: Internet of Things)", Question[34]: "Volume, Variety, Velocity", Question[35]: "머신러닝", Question[36]: "딥러닝",
                  Question[37]: "지식의 확장, 소통의 확장, 시공간의 확장", Question[38]: "괴델의 <불완전성 정리>", Question[39]: "범용 튜링기계", Question[40]: "조지 부울(George Boole)",
                  Question[41]: "클로드 섀넌(Claude Shannon), 논리게이트",Question[42]: "1인 미디어", Question[43]: "인공지능"
                  }

random.shuffle(Question)

cnt = 1
for i in Question:
        print(cnt, ':', i, "[ 남은 문제:", len(Question)-cnt, "]")
        input()
        print("해답:", Question_solve[i])
        print()
        cnt += 1